blog-posts/2006-08-17-emacs-hacks-snail-mail-surprise.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs hacks: Snail mail surprise</title>
<!-- 2014-04-30 Wed 17:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs hacks: Snail mail surprise</h1>
<p>
August 17th, 2006 -
<a href="http://sachachua.com/blog/p/3763"><a href="http://sachachua.com/blog/p/3763">http://sachachua.com/blog/p/3763</a></a>
</p>

<p>
I like sending snail mail. This Emacs Lisp snippet displays all the
 contacts for whom I have addresses, sorted according to country. This
 makes it easy for me to, say, jump to all the USA contacts whom I
 should mail before heading back over the border.
</p>

<pre class="example">
(defun sacha/bbdb-filter-records-for-address (records)
  "Filter records for addresses."
  (sort
   (delq nil
         (mapcar
          (lambda (rec) (and (bbdb-record-addresses rec) rec))
          records))
   (lambda (a b)
     (string&lt; (bbdb-address-country (car (bbdb-record-addresses a)))
              (bbdb-address-country (car (bbdb-record-addresses b)))))))

;; Do the actual work here
(bbdb-display-records (sacha/bbdb-filter-records-for-address (bbdb-records)))
</pre>

<p>
On Technorati: <a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/pimpmyemacs">pimpmyemacs</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
